export default function ConsentPersonalDataPage() {
  return (
    <main className="max-w-4xl mx-auto px-4 py-10 md:py-14">
      <h1 className="text-3xl md:text-4xl font-bold mb-6">
        Согласие на обработку персональных данных
      </h1>

      <div className="space-y-4 text-base leading-relaxed text-gray-800">
        <p>
          Я даю согласие Тарбастаеву Алексею Григорьевичу (Самозанятый, ИНН
          382700877047) на обработку моих персональных данных, указанных в
          Политике конфиденциальности и обработки персональных данных в
          соответствии с Федеральным законом от 27.07.2006 N 152-ФЗ «О
          персональных данных».
        </p>
        <p>
          Отправляя данную форму мое согласие выражается в форме конклюдентных
          действий, а именно при: использовании сайта; заполнении
          соответствующих электронных форм; направлении своих персональных
          данных Оператору любым иным способом.
        </p>
        <p>
          Настоящее согласие дается на обработку следующих моих персональных
          данных: Фамилия, имя, отчество; Номер телефона; Адрес электронной
          почты; Почтовый адрес (для направления печатных материалов).
        </p>

        <div>
          <p className="mb-2">
            Оператор вправе обрабатывать мои данные в следующих целях:
          </p>
          <ul className="list-disc pl-6 space-y-1">
            <li>предоставления доступа к сервисам, информации и материалам;</li>
            <li>
              отправки информационных и рекламных рассылок (включая e-mail и
              SMS);
            </li>
            <li>
              направления обратной связи, запросов отзывов и рекомендаций.
            </li>
          </ul>
        </div>

        <p>
          Я подтверждаю, что ознакомлен(а): с положениями Федерального закона N
          152-ФЗ «О персональных данных»; с Политикой Оператора в отношении
          обработки персональных данных, размещенной по адресу:
          https://www.tarbastaev.ru/; со своими правами и обязанностями в
          области защиты персональных данных. Заполняя формы и передавая данные
          Оператору, я выражаю безоговорочное согласие со всеми условиями
          указанной Политики.
        </p>

        <p>
          Право на отзыв согласия: Срок действия настоящего согласия
          определяется до момента его отзыва. Я осведомлен(а), что вправе в
          любой момент отозвать настоящее согласие, направив соответствующее
          письменное уведомление по электронной почте: AG@Tarbastaev.ru. Я
          понимаю, что отзыв согласия повлечет невозможность дальнейшего
          использования функционала сайта и услуг Оператора. В случае несогласия
          с условиями Политики я обязан(а) воздержаться от передачи персональных
          данных и заполнения форм на сайте.
        </p>
      </div>
    </main>
  );
}
