import { ISurveyData, IQuestion } from "@/types/survey";

export const firstSurveyQuestions: IQuestion[] = [
  {
    id: 0,
    text: "Равноправие для всех",
    position: 0,
  },
  {
    id: 1,
    text: "Контроль над другими людьми",
    position: 1,
  },
  {
    id: 2,
    text: "Удовольствие от удовлетворения своих желаний",
    position: 2,
  },
  {
    id: 3,
    text: "Свобода мыслей, слов и действий",
    position: 3,
  },
  {
    id: 4,
    text: "Порядок и стабильность в обществе",
    position: 4,
  },
  {
    id: 5,
    text: "Новые яркие впечатления от жизни",
    position: 5,
  },
  {
    id: 6,
    text: "Вежливость, как следствие хорошего воспитания",
    position: 6,
  },
  {
    id: 7,
    text: "Богатство (деньги, недвижимость, предметы)",
    position: 7,
  },
  {
    id: 8,
    text: "Защищённость своей страны от врагов",
    position: 8,
  },
  {
    id: 9,
    text: "Уважение другого мнения",
    position: 9,
  },
  {
    id: 10,
    text: "Изобретательность (богатое воображение)",
    position: 10,
  },
  {
    id: 11,
    text: "Мир во всём мире",
    position: 11,
  },
  {
    id: 12,
    text: "Сохранение обычаев",
    position: 12,
  },
  {
    id: 13,
    text: "Самодисциплина",
    position: 13,
  },
  {
    id: 14,
    text: "Безопасность для близких людей",
    position: 14,
  },
  {
    id: 15,
    text: "Быть в единстве с природой",
    position: 15,
  },
  {
    id: 16,
    text: "Постоянные изменения в жизни, обусловленные проблемами и новизной",
    position: 16,
  },
  {
    id: 17,
    text: "Мудрость (опыт в понимании мира)",
    position: 17,
  },
  {
    id: 18,
    text: "Быть лидером и командовать",
    position: 18,
  },
  {
    id: 19,
    text: "Красота природы",
    position: 19,
  },
  {
    id: 20,
    text: "Исправление несправедливости в обществе (забота о слабых)",
    position: 20,
  },
];

export const secondSurveyQuestions: IQuestion[] = [
  {
    id: 21,
    text: "… самостоятельно, надеяться на себя",
    position: 21,
  },
  {
    id: 22,
    text: "… сдержано, избегать крайностей в чувствах и поступках",
    position: 22,
  },
  {
    id: 23,
    text: "… сохраняя верность, преданность друзьям, группе",
    position: 23,
  },
  {
    id: 24,
    text: "… достигая цели трудолюбиво, вдохновенно",
    position: 24,
  },
  {
    id: 25,
    text: "… открыто к чужим мнениям, различным идеям и верованиям",
    position: 25,
  },
  {
    id: 26,
    text: "… скромно, без привлечения внимания к себе",
    position: 26,
  },
  {
    id: 27,
    text: "… смело, с приключениями и риском",
    position: 27,
  },
  {
    id: 28,
    text: "… сохраняя природу, защищая окружающую среду",
    position: 28,
  },
  {
    id: 29,
    text: "… оказывая влияние на людей и события",
    position: 29,
  },
  {
    id: 30,
    text: "… уважая родителей и старших",
    position: 30,
  },
  {
    id: 31,
    text: "… выбирая собственные цели",
    position: 31,
  },
  {
    id: 32,
    text: "… эффективно со знанием дела",
    position: 32,
  },
  {
    id: 33,
    text: "… подчиняясь жизненным обстоятельствам",
    position: 33,
  },
  {
    id: 34,
    text: "… честно, откровенно, искренне",
    position: 34,
  },
  {
    id: 35,
    text: "… сохраняя свою честь (имидж)",
    position: 35,
  },
  {
    id: 36,
    text: "… послушно, подчиняясь правилам",
    position: 36,
  },
  {
    id: 37,
    text: "… с пользой и на благо других",
    position: 37,
  },
  {
    id: 38,
    text: "… наслаждаясь жизнью (едой, близостью, развлечениями)",
    position: 38,
  },
  {
    id: 39,
    text: "… придерживаясь религиозной веры и убеждений",
    position: 39,
  },
  {
    id: 40,
    text: "… ответственно, надёжно, вызывая доверие",
    position: 40,
  },
  {
    id: 41,
    text: "… любознательно, пытливо интересуясь всем",
    position: 41,
  },
  {
    id: 42,
    text: "… со склонностью прощать (стремясь прощать других)",
    position: 42,
  },
  {
    id: 43,
    text: "… успешно достигая цели",
    position: 43,
  },
  {
    id: 44,
    text: "… аккуратно, сохраняя чистоту и опрятность",
    position: 44,
  },
  {
    id: 45,
    text: "… потворствуя своим желаниям (тем, что доставляет удовольствие)",
    position: 45,
  },
];

export const thirdSurveyQuestions: IQuestion[] = [
  {
    id: 46,
    text: "Он стремится делать все лучше, чем другие. Быть успешным в жизни важно для него.",
    position: 46,
  },
  {
    id: 47,
    text: "Он прощает людей, которые обидели его. Он умеет видеть хорошее в них и забыть обиду.",
    position: 47,
  },
  {
    id: 48,
    text: "Он независим и полагается только на себя.",
    position: 48,
  },
  {
    id: 49,
    text: "Он беспокоится о поддержании общественного порядка.",
    position: 49,
  },
  {
    id: 50,
    text: "Он старается быть вежливым. Никогда не раздражать и не беспокоить других людей.",
    position: 50,
  },
  {
    id: 51,
    text: "Он наслаждается жизнью. Хорошо проводить время очень важно для него.",
    position: 51,
  },
  {
    id: 52,
    text: "Он ведёт себя скромно. Старается не привлекать к себе внимание.",
    position: 52,
  },
  {
    id: 53,
    text: "Он тот, кто принимает стратегические решения. Ему нравится быть лидером.",
    position: 53,
  },
  {
    id: 54,
    text: "Он верит, что люди не должны изменять природу. Он приспосабливается к природе, старается быть её частью.",
    position: 54,
  },
];

export const surveyData: ISurveyData = {
  id: 0,
  name: "string",
  countQuestions: 0,
  description: "string",
  questionGroups: [
    {
      id: 1,
      name: "string",
      position: 1,
      header:
        "Оцените насколько важны для вас ценности, как руководство в жизни",
      leftText: "Абсолютно не важная ценность",
      rightText: "Исключительно важная ценность",
      questions: firstSurveyQuestions,
    },
    {
      id: 2,
      name: "string",
      position: 2,
      header:
        "Теперь оцените, насколько важны для Вас ценности как способы действия в жизни. Продолжите фразу : Для меня важно действовать...",
      leftText: "Абсолютно не важно",
      rightText: "Исключительно важно",
      questions: secondSurveyQuestions,
    },
    {
      id: 3,
      name: "string",
      position: 3,
      header:
        "Прочитайте описания некоторых людей и укажите, насколько каждый человек похож на Вас",
      leftText: "Совсем не похож",
      rightText: "Очень похож",
      questions: thirdSurveyQuestions,
    },
  ],
  model: "SVS_46",
  personTestId: 0,
  testId: 0,
  personId: 0,
};
